# 빈 자리는 빈 공간으로 두고, 오른쪽 정렬을 하되, 총 10자리 공간을 확보
print("{0: >10}" .format(500))  #       500

# 양수일 땐 +로 표시, 음수일 땐 -로 표시
print("{0: >+10}" .format(500))
print("{0: >+10}" .format(-500))

#왼쪽 정렬하고, 빈칸을 _로 채움
print("{0:_<+10}" .format(-500))  #-500______

# 세자리마다 콤마 찍어주기
print("{0:,}" .format(10000000000)) #10,000,000,000

# 세자리마다 콤마 찍어주면서 부호 붙이기
print("{0:+,}" .format(10000000000))  #+10,000,000,000
 
# 세자리마다 콤마찍고, 부호 붙이고, 자릿수 확보하기
# 빈자리는 ^로 채우기
print("{0:^<+30,}" .format(10000000000))  #+10,000,000,000^^^^^^^^^^^^^^^

# 소수점 출력하기
print("{0:f}" .format(5/3))  #1.666667
# 특정자리수까지만 소수점 나타내기 (소수점 셋째자리에서 반올림)
print("{0:.2f}" .format(5/3))  #1.67

